#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_zone.lojzatv_cz: Refreshing state... [id=303d28fa62af4ae718b995d81826b16f]
cloudflare_zone.kozak_in: Refreshing state... [id=7e83bba5abbc13ea023d9a93f9fbe16c]
cloudflare_zone.kozeltv_cz: Refreshing state... [id=50251f952189c4a427154677dc88057c]
cloudflare_record.kozak_in_ip_v4: Refreshing state... [id=aef3bc4f99249c1bb1b0cf3d06238621]
cloudflare_record.kozak_in_sendgrid_s2: Refreshing state... [id=287533d36b38df4a1aa66065446f9ced]
cloudflare_record.kozak_in_spf: Refreshing state... [id=df8e87c2ae502a956e4d609061ba9d5a]
cloudflare_record.kozak_in_mx_1: Refreshing state... [id=a0723f22226ed5010bcbc67582fd0d8f]
cloudflare_record.kozak_in_ip_v6: Refreshing state... [id=a6cf917b897f54bbaa29ce7950fe7535]
cloudflare_record.kozak_in_sendgrid_em: Refreshing state... [id=aaf3e78f4245e95d19850c110efc91a5]
cloudflare_record.kozak_in_google_verification: Refreshing state... [id=7510741dbb637307a4ddc5185580a0c9]
cloudflare_record.kozak_in_sendgrid_s1: Refreshing state... [id=711b8a21088e8e0ab4ada17b33ac01fc]
cloudflare_record.kozak_in_mx_2: Refreshing state... [id=43b29e5450cfa3f1683c93cd0c531e79]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.kozeltv_cz_ip_v4 will be created
  + resource "cloudflare_record" "kozeltv_cz_ip_v4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "kozeltv.cz"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "89.221.215.36"
      + zone_id         = "50251f952189c4a427154677dc88057c"
    }

  # cloudflare_record.kozeltv_cz_ip_v6 will be created
  + resource "cloudflare_record" "kozeltv_cz_ip_v6" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "kozeltv.cz"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2a02:2b88:2:424::"
      + zone_id         = "50251f952189c4a427154677dc88057c"
    }

  # cloudflare_record.lojzatv_cz_ip_v4 will be created
  + resource "cloudflare_record" "lojzatv_cz_ip_v4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lojzatv.cz"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "89.221.215.36"
      + zone_id         = "303d28fa62af4ae718b995d81826b16f"
    }

  # cloudflare_record.lojzatv_cz_ip_v6 will be created
  + resource "cloudflare_record" "lojzatv_cz_ip_v6" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lojzatv.cz"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2a02:2b88:2:424::"
      + zone_id         = "303d28fa62af4ae718b995d81826b16f"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kozaktomas, Action: `pull_request`*